brodricyoung/nucleo-stm32/ecen260-stm32/Lab7_HAL/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ARMBUTTON_Pin GPIO_PIN_13
#define ARMBUTTON_GPIO_Port GPIOC
#define DISARMBUTTON_Pin GPIO_PIN_0
#define DISARMBUTTON_GPIO_Port GPIOA
#define FRONTSENSOR_Pin GPIO_PIN_1
#define FRONTSENSOR_GPIO_Port GPIOA
#define BACKSENSOR_Pin GPIO_PIN_4
#define BACKSENSOR_GPIO_Port GPIOA
#define ARMLED_Pin GPIO_PIN_5
#define ARMLED_GPIO_Port GPIOA
#define WINDOWSENSOR_Pin GPIO_PIN_6
#define WINDOWSENSOR_GPIO_Port GPIOA
#define FRONTALARM_Pin GPIO_PIN_7
#define FRONTALARM_GPIO_Port GPIOA
#define BACKALARM_Pin GPIO_PIN_8
#define BACKALARM_GPIO_Port GPIOA
#define WINDOWALARM_Pin GPIO_PIN_9
#define WINDOWALARM_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
